docs/benchmark/results-luring-pool-vs-nginx-20260727/raw/luring-100-r1.txt
Running 10s test @ http://127.0.0.1:8081/
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   452.31us  457.80us   7.64ms   92.83%
    Req/Sec    31.27k     4.67k  112.40k    93.39%
  Latency Distribution
     50%  341.00us
     75%  456.00us
     90%  693.00us
     99%    2.78ms
  2494980 requests in 10.10s, 1.56GB read
Requests/sec: 247016.96
Transfer/sec:    157.83MB