docs/benchmark/results-luring-pool-vs-nginx-20260727/raw/luring-1000-r1.txt
Running 10s test @ http://127.0.0.1:8081/
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.46ms    1.12ms  33.47ms   80.99%
    Req/Sec    19.44k     0.95k   32.08k    83.38%
  Latency Distribution
     50%    6.32ms
     75%    6.90ms
     90%    7.63ms
     99%   10.18ms
  1547395 requests in 10.03s, 0.97GB read
Requests/sec: 154318.00
Transfer/sec:     98.60MB