docs/benchmark/results-luring-pool-vs-nginx-20260727/raw/luring-5000-r3.txt
Running 10s test @ http://127.0.0.1:8081/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.00ms   15.76ms 614.55ms   98.59%
    Req/Sec    18.82k     1.80k   21.11k    85.12%
  Latency Distribution
     50%   32.54ms
     75%   34.86ms
     90%   38.22ms
     99%   52.83ms
  1498631 requests in 10.06s, 0.94GB read
Requests/sec: 148995.90
Transfer/sec:     95.20MB