docs/benchmark/results-luring-pool-vs-nginx-20260727/raw/nginx-2000-r3.txt
Running 10s test @ http://127.0.0.1:8088/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.92ms    3.05ms  44.56ms   70.29%
    Req/Sec    19.43k     1.56k   22.73k    72.38%
  Latency Distribution
     50%   12.28ms
     75%   15.22ms
     90%   16.23ms
     99%   23.37ms
  1546858 requests in 10.03s, 0.96GB read
Requests/sec: 154193.58
Transfer/sec:     98.08MB