docs/benchmark/results-luring-pool-vs-nginx-20260727/raw/nginx-5000-r2.txt
Running 10s test @ http://127.0.0.1:8088/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.40ms    8.75ms  89.36ms   71.49%
    Req/Sec    18.79k     1.92k   22.82k    68.50%
  Latency Distribution
     50%   30.13ms
     75%   39.51ms
     90%   44.85ms
     99%   63.36ms
  1495554 requests in 10.06s, 0.93GB read
Requests/sec: 148689.21
Transfer/sec:     94.58MB