docs/benchmark/results-luring-pool-vs-nginx-20260727/raw/reactor-2000-r2.txt
Running 10s test @ http://127.0.0.1:8080/
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.54ms    3.38ms  43.85ms   70.36%
    Req/Sec    15.17k   763.57    17.28k    72.88%
  Latency Distribution
     50%   15.74ms
     75%   18.91ms
     90%   20.93ms
     99%   25.66ms
  1207736 requests in 10.03s, 771.70MB read
Requests/sec: 120449.22
Transfer/sec:     76.96MB