docs/benchmark/results-luring-pool-vs-nginx-20260727/raw/reactor-5000-r3.txt
Running 10s test @ http://127.0.0.1:8080/
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.68ms   10.73ms 114.97ms   74.98%
    Req/Sec    12.60k     1.05k   14.80k    83.50%
  Latency Distribution
     50%   47.87ms
     75%   57.28ms
     90%   62.05ms
     99%   85.08ms
  1003545 requests in 10.05s, 641.23MB read
Requests/sec:  99840.35
Transfer/sec:     63.79MB